// Код програми повинен обчислити з координат двох 
// заданих точок M1(x1, y1, z1) та M2(x2, y2, z2) та 
// деякого коефіцієнту k, координати точки M0(x0, y0, z0)
// яка ділить відрізки M1, M2 у відношенні k

#include <stdio.h>
#include <Windows.h>

int main(){

    // Налаштування вводу кирилиці
    SetConsoleCP(1251);   
	SetConsoleOutputCP(1251);
    SetConsoleOutputCP(CP_UTF8);

    // Оголошення констант та змiнних:
    float M1[3], M2[3], M0[3]; // точки M1, M2, M0
    float k; // коефіцієнт k

    // Ввiд заданих величин:
    printf(" Введіть координати точки M1 (x1, y1, z1): \n");
    
    printf("\t x1 = "); scanf("%f", &M1[0]);

    printf("\t y1 = "); scanf("%f", &M1[1]);

    printf("\t z1 = "); scanf("%f", &M1[2]);


    printf(" \nВведіть координати точки M2 (x2, y2, z2): \n");
    
    printf("\t x2 = "); scanf("%f", &M2[0]);

    printf("\t y2 = "); scanf("%f", &M2[1]);

    printf("\t z2 = "); scanf("%f", &M2[2]);


    printf(" \nВведіть коефіцієнт k: "); scanf("%f", &k);

    
    // Обчислення координат точки M0:
    M0[0] = (M1[0] + k*M2[0]) / (1 + k); // обчислення координати x
    M0[1] = (M1[1] + k*M2[1]) / (1 + k); // обчислення координати y
    M0[2] = (M1[2] + k*M2[2]) / (1 + k); // обчислення координати z


    // Друк результатів:
    printf("\nКоординати точки M0 (%.2f, %.2f, %.2f)", M0[0], M0[1], M0[2]);
}