/*****************************************************/
/* lab_work_01_01. */
/* Лiнiйнi обчислювальнi процеси засобами мови С. */
/* Дано: R- радiус основи прямого кругового */
/* цилiндра; h - висота прямого кругового цилiндра. */
/* Oбчислити та вивести на друк: */
/* sb=2*pi*r*h - площу бiчної поверхнi цилiндра; */
/* sp=sb+2*pi*r*r - площу повної поверхнi цилiндра; */
/* v=pi*r*r*h - об'єм цилiндра. */
/* Результати розрахункiв подати у виглядi таблицi.*/
/* */
/*****************************************************/

#include <stdio.h>
#include <conio.h>
#include <math.h>
#include <Windows.h>

int main() {

    SetConsoleCP(1251);   
	SetConsoleOutputCP(1251);
    SetConsoleOutputCP(CP_UTF8);

// Оголошення констант та змiнних:

const float pi=3.14159; // оголошення константи pi
float r; // радiус основи прямого кругового цилiндра
float h; // висота прямого кругового цилiндра
float sb; // площа бiчної поверхнi цилiндра
float sp; // площа повної поверхнi цилiндра
float v; // об'єм цилiндра

// Ввiд заданих величин:
printf (" Введіть радіус основи циліндру: ");
scanf("%f",&r);

printf (" Введiть висоту цилiндра: "); 
scanf("%f",&h);

// Обчислення параметрiв цилiндра:
sb=2*pi*r*h; 
sp=sb+2*pi*r*r*h;
v=pi*r*h*h;

// Друк результатiв у виглядi таблицi:
printf("\n Вхiднi величини та результати обчислень:");
printf("\n I ------------------------------------------- I");
printf("\n I Вхiднi величини: I");
printf("\n I ------------------------------------------- I");
printf("\n I Радiус основи цилiндра I %8.2f I",r);
printf("\n I -------------------------------------------- ");
printf("\n I Висота цилiндра I %8.2f I",h);
printf("\n I ------------------------------------------- I");
printf("\n I Результати обчислень: I");
printf("\n I ------------------------------------------- I");
printf("\n I Бiчна поверхня цилiндра I %8.2f I",sb);
printf("\n I ------------------------------------------- I");
printf("\n I Повна поверхня цилiндра I %8.2f I",sp);
printf("\n I ------------------------------------------- I");
printf("\n I Об’єм цилiндра I %8.2f I",v);
printf("\n I ------------------------------------------- I\n");

getch(); //Затримка результатів обчислення на екрані

return 0;

}

